app/controllers/inmates_controller.rb

SELECT  "inmates".* FROM "inmates" WHERE "inmates"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @inmate = Inmate.find(params[:id])

SELECT "inmates".* FROM "inmates"
---
  def index
    @inmates = Inmate.all

SELECT  "inmates".* FROM "inmates" WHERE "inmates"."id" = $1 LIMIT 1  [["id", 6]]
---
  def edit
    @inmate = Inmate.find(params[:id])

INSERT INTO "inmates" ("first_name", "last_name", "nick_name", "power", "bio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["nick_name", "Test Villain"], ["power", ""], ["bio", ""], ["created_at", "2016-02-06 03:30:45.263960"], ["updated_at", "2016-02-06 03:30:45.263960"]]
---
  def create
    #render plain: params[:inmate].inspect
    @inmate = Inmate.new(inmate_params)

    if @inmate.save

SELECT  "inmates".* FROM "inmates" WHERE "inmates"."id" = $1 LIMIT 1  [["id", 5]]
UPDATE "inmates" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "inmates"."id" = $4  [["first_name", "Tom"], ["last_name", "Sawyeer"], ["updated_at", "2016-02-06 01:32:36.713324"], ["id", 1]]
---
  def update
    @inmate = Inmate.find(params[:id])

    if @inmate.update(inmate_params)

SELECT  "inmates".* FROM "inmates" WHERE "inmates"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "inmates" WHERE "inmates"."id" = $1  [["id", 3]]
---
  def destroy
    @inmate = Inmate.find(params[:id])
    @inmate.destroy